<a href="https://colab.research.google.com/github/barja8/python_intro/blob/master/session/py_session04.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introduction to pandas

In [0]:
import pandas as pd

In [4]:
data = pd.read_csv('http://faculty.marshall.usc.edu/gareth-james/ISL/Auto.csv')
print(data)

      mpg  cylinders  displacement  ... year  origin                       name
0    18.0          8         307.0  ...   70       1  chevrolet chevelle malibu
1    15.0          8         350.0  ...   70       1          buick skylark 320
2    18.0          8         318.0  ...   70       1         plymouth satellite
3    16.0          8         304.0  ...   70       1              amc rebel sst
4    17.0          8         302.0  ...   70       1                ford torino
..    ...        ...           ...  ...  ...     ...                        ...
392  27.0          4         140.0  ...   82       1            ford mustang gl
393  44.0          4          97.0  ...   82       2                  vw pickup
394  32.0          4         135.0  ...   82       1              dodge rampage
395  28.0          4         120.0  ...   82       1                ford ranger
396  31.0          4         119.0  ...   82       1                 chevy s-10

[397 rows x 9 columns]

In [6]:
data.head()

    mpg  cylinders  displacement  ... year  origin                       name
0  18.0          8         307.0  ...   70       1  chevrolet chevelle malibu
1  15.0          8         350.0  ...   70       1          buick skylark 320
2  18.0          8         318.0  ...   70       1         plymouth satellite
3  16.0          8         304.0  ...   70       1              amc rebel sst
4  17.0          8         302.0  ...   70       1                ford torino

[5 rows x 9 columns]

In [7]:
data.tail()

      mpg  cylinders  displacement  ... year  origin             name
392  27.0          4         140.0  ...   82       1  ford mustang gl
393  44.0          4          97.0  ...   82       2        vw pickup
394  32.0          4         135.0  ...   82       1    dodge rampage
395  28.0          4         120.0  ...   82       1      ford ranger
396  31.0          4         119.0  ...   82       1       chevy s-10

[5 rows x 9 columns]

In [11]:
# data.head(3) # The same is the function tail()
# the function shape show we the numbre of rows and columns
data.shape

(397, 9)

In [13]:
# The answer is a type boolean (True or False)
data.isnull()

       mpg  cylinders  displacement  ...   year  origin   name
0    False      False         False  ...  False   False  False
1    False      False         False  ...  False   False  False
2    False      False         False  ...  False   False  False
3    False      False         False  ...  False   False  False
4    False      False         False  ...  False   False  False
..     ...        ...           ...  ...    ...     ...    ...
392  False      False         False  ...  False   False  False
393  False      False         False  ...  False   False  False
394  False      False         False  ...  False   False  False
395  False      False         False  ...  False   False  False
396  False      False         False  ...  False   False  False

[397 rows x 9 columns]

In [14]:
# For count the totall of use the function .sum()
data.isnull().sum()

mpg             0
cylinders       0
displacement    0
horsepower      0
weight          0
acceleration    0
year            0
origin          0
name            0
dtype: int64

In [16]:
# For indetify the type of data use the function .dtypes
data.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight            int64
acceleration    float64
year              int64
origin            int64
name             object
dtype: object

In [17]:
# If we want to know an additional information about our data, we use the function .info()
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
mpg             397 non-null float64
cylinders       397 non-null int64
displacement    397 non-null float64
horsepower      397 non-null object
weight          397 non-null int64
acceleration    397 non-null float64
year            397 non-null int64
origin          397 non-null int64
name            397 non-null object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.0+ KB

In [0]:
# Working structure data with pandas in python
import numpy as np 
import pandas as pd

In [20]:
# Creation the new object 
# Rembember that the are two data types in pandas
# one is series and second is dataframe
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [34]:
# Creation the new dataframe
dates = pd.date_range('20130101',periods = 6)
print(dates)

df = pd.DataFrame(np.random.rand(6,4), index = dates, columns=list('ABCD'))
print('---'*24)
print(df)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')
------------------------------------------------------------------------
                   A         B         C         D
2013-01-01  0.969847  0.388738  0.941085  0.052568
2013-01-02  0.085872  0.740063  0.427725  0.022629
2013-01-03  0.704782  0.243120  0.313436  0.379319
2013-01-04  0.545721  0.595450  0.060840  0.258553
2013-01-05  0.737017  0.510637  0.866206  0.458213
2013-01-06  0.240163  0.336806  0.604552  0.553561

In [57]:
# Creation of a new dataframe from a dictionary
df2 = pd.DataFrame({'A': 1.2,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1.25, index = list(range(4)),dtype = 'float32'),
                    'D': np.array([3]* 4, dtype = 'int32'),
                    'E': pd.Categorical(['test','train','test','train']),
                    'F': 'foo'})
print(df2)
df2.info

     A          B     C  D      E    F
0  1.2 2013-01-02  1.25  3   test  foo
1  1.2 2013-01-02  1.25  3  train  foo
2  1.2 2013-01-02  1.25  3   test  foo
3  1.2 2013-01-02  1.25  3  train  foo

<bound method DataFrame.info of      A          B     C  D      E    F
0  1.2 2013-01-02  1.25  3   test  foo
1  1.2 2013-01-02  1.25  3  train  foo
2  1.2 2013-01-02  1.25  3   test  foo
3  1.2 2013-01-02  1.25  3  train  foo>

In [49]:
df2.isnull().sum()
df2.head

<bound method NDFrame.head of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [50]:
df2.tail

<bound method NDFrame.tail of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [51]:
df2.shape

(4, 6)

In [54]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [68]:
# You can select one specific column with your name
df2.B

0   2013-01-02
1   2013-01-02
2   2013-01-02
3   2013-01-02
Name: B, dtype: datetime64[ns]

# Viewing data

In [72]:
df.head()

                   A         B         C         D
2013-01-01  0.969847  0.388738  0.941085  0.052568
2013-01-02  0.085872  0.740063  0.427725  0.022629
2013-01-03  0.704782  0.243120  0.313436  0.379319
2013-01-04  0.545721  0.595450  0.060840  0.258553
2013-01-05  0.737017  0.510637  0.866206  0.458213

In [73]:
df.tail()

                   A         B         C         D
2013-01-02  0.085872  0.740063  0.427725  0.022629
2013-01-03  0.704782  0.243120  0.313436  0.379319
2013-01-04  0.545721  0.595450  0.060840  0.258553
2013-01-05  0.737017  0.510637  0.866206  0.458213
2013-01-06  0.240163  0.336806  0.604552  0.553561

In [77]:
# Display the index, columns:
print(df.index)
print('---'*24)
print(df.columns)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')
------------------------------------------------------------------------
Index(['A', 'B', 'C', 'D'], dtype='object')

In [78]:
df.head()

                   A         B         C         D
2013-01-01  0.969847  0.388738  0.941085  0.052568
2013-01-02  0.085872  0.740063  0.427725  0.022629
2013-01-03  0.704782  0.243120  0.313436  0.379319
2013-01-04  0.545721  0.595450  0.060840  0.258553
2013-01-05  0.737017  0.510637  0.866206  0.458213

In [79]:
df.to_numpy()

array([[0.96984692, 0.38873771, 0.94108485, 0.05256766],
       [0.08587244, 0.74006266, 0.42772482, 0.0226285 ],
       [0.70478201, 0.24311966, 0.31343551, 0.37931943],
       [0.54572066, 0.59545031, 0.06083957, 0.25855267],
       [0.73701687, 0.51063734, 0.86620644, 0.45821335],
       [0.24016274, 0.33680565, 0.60455197, 0.55356098]])

In [80]:
df2.to_numpy()

array([[1.2, Timestamp('2013-01-02 00:00:00'), 1.25, 3, 'test', 'foo'],
       [1.2, Timestamp('2013-01-02 00:00:00'), 1.25, 3, 'train', 'foo'],
       [1.2, Timestamp('2013-01-02 00:00:00'), 1.25, 3, 'test', 'foo'],
       [1.2, Timestamp('2013-01-02 00:00:00'), 1.25, 3, 'train', 'foo']],
      dtype=object)

In [81]:
# The function describe is similiar
# to summary in R, this function show the basic statistic
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.547234  0.469136  0.535641  0.287474
std    0.330633  0.182284  0.336114  0.216587
min    0.085872  0.243120  0.060840  0.022629
25%    0.316552  0.349789  0.342008  0.104064
50%    0.625251  0.449688  0.516138  0.318936
75%    0.728958  0.574247  0.800793  0.438490
max    0.969847  0.740063  0.941085  0.553561

In [82]:
df2.describe()

         A     C    D
count  4.0  4.00  4.0
mean   1.2  1.25  3.0
std    0.0  0.00  0.0
min    1.2  1.25  3.0
25%    1.2  1.25  3.0
50%    1.2  1.25  3.0
75%    1.2  1.25  3.0
max    1.2  1.25  3.0

In [83]:
# You can transposing your data using ".T"
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.969847    0.085872    0.704782    0.545721    0.737017    0.240163
B    0.388738    0.740063    0.243120    0.595450    0.510637    0.336806
C    0.941085    0.427725    0.313436    0.060840    0.866206    0.604552
D    0.052568    0.022629    0.379319    0.258553    0.458213    0.553561

In [86]:
# You can sorting your table using the function sort_index
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01  0.052568  0.941085  0.388738  0.969847
2013-01-02  0.022629  0.427725  0.740063  0.085872
2013-01-03  0.379319  0.313436  0.243120  0.704782
2013-01-04  0.258553  0.060840  0.595450  0.545721
2013-01-05  0.458213  0.866206  0.510637  0.737017
2013-01-06  0.553561  0.604552  0.336806  0.240163

In [92]:
# Sorting by value of a specfic column of low value to high value
df.sort_values(by = 'A')

                   A         B         C         D
2013-01-02  0.085872  0.740063  0.427725  0.022629
2013-01-06  0.240163  0.336806  0.604552  0.553561
2013-01-04  0.545721  0.595450  0.060840  0.258553
2013-01-03  0.704782  0.243120  0.313436  0.379319
2013-01-05  0.737017  0.510637  0.866206  0.458213
2013-01-01  0.969847  0.388738  0.941085  0.052568

######*Fuente:https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html*